---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.BackgroundColor
source: html/67d7d339-07d6-bd6d-a67c-189274892531.htm
---
# Autodesk.Revit.DB.TableCellStyle.BackgroundColor Property

The background color of this cell in the grid view.

## Syntax (C#)
```csharp
public Color BackgroundColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null